In [45]:
import pandas as pd

years = [2020, 2021, 2021, 2022, 2023]
months = [1, 2, 9, 3, 4]
days = [5, 6, 5, 7, 8]
expenses = [1000, 1050.5, 1069.2,  980.8, 1115.6]

df = pd.DataFrame({'year': years, 'month': months, 'Tag': days, 'expenses': expenses})
df

   year  month  Tag  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
2  2021      9    5    1069.2
3  2022      3    7     980.8
4  2023      4    8    1115.6

How to select **certain columns** from **certain rows**

In [46]:
df[df['year'] == 2021][['Tag','month']]

   Tag  month
1    6      2
2    5      9

Drop duplicates

In [47]:
df.drop_duplicates(subset='year', inplace = True)
df

   year  month  Tag  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
3  2022      3    7     980.8
4  2023      4    8    1115.6

Rename columns

In [48]:
df.rename(columns={'Tag':'day'},inplace=True)
df

   year  month  day  expenses
0  2020      1    5    1000.0
1  2021      2    6    1050.5
3  2022      3    7     980.8
4  2023      4    8    1115.6

Convert column types

In [49]:
df['expenses'] = df['expenses'].round()
df['expenses'] = df['expenses'].astype(int)
df

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
3  2022      3    7       981
4  2023      4    8      1116

In [50]:
years = [2024, 2025]
months = [1, 2]
days = [5, 6]
expenses = [1000, 1050]

df2 = pd.DataFrame({'year': years, 'month': months, 'day': days, 'expenses': expenses})

Concatenating two df-s (**add new df below**)

In [59]:
df_new = pd.concat([df,df2])
df_new

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
3  2022      3    7       981
4  2023      4    8      1116
0  2024      1    5      1000
1  2025      2    6      1050